


"""
1.计算列表中指定元素的个数，并列出它们的索引值
list_01 = ['h', 'e', 'l', 'l', '0', 'h', 'k']
tag =  'h'
"""


"""
2.列表反转
list_01 = ['h', 'e', 'l', 'l', '0', 'h', 'k']
==> ['k', 'h', '0', 'l', 'l', 'e', 'h']
注：不能生成新的列表
"""


"""
nums = [1, 2, 3, 4, 5, 6, 14, 10, 13, 1]
3.求列表nums所有元素的和     nums_all
4.求列表nums所有奇数元素的和 nums_ji
5.求列表nums所有偶数元素的和 nums_ou
6.找出列表nums里面最大的数   nums_max 
7.找出列表nums里面最小的数   nums_min
8.找出列表nums里面相同元素分别有多少个 nums_count
9.对列表进行去重             nums_set
10.删除列表nums里面所有大于10的数（注：不能创建新的列表，需在原列表基础上进行修改。）
"""

