


"""
月考
"""

"""
第一题：
http、wsgi、wsgiref、web服务器、webAPP分别是什么，尽量准确详细的解释
"""


"""
第二题：
简述一个浏览器请求的过程，
并且说一下打开一个网站页面浏览器会发出多少个请求，为什么
"""


"""
第三题：
简述你所了解的关于http协议的一些东西，
并说一下get/post请求的区别
"""


"""
第四题：
写一个类实现一个网站服务

class WebServer:

    pass
    
webserver = WebServer()  # 实例化
webserver.run()          # 启动网站服务
"""


"""
第五题：
lst = [1, 2, 'abc', [], (), {}, 'cba', 3]
计算列表lst里面有多少种数据类型
"""


"""
第六题：
写一个函数，该函数接收一个参数nums，根据nums来控制打印的列表的数量
找规律打印相应的列表
n01 = [1]
n02 = [1, 1]
n03 = [1, 2, 1]
n04 = [1, 3, 3, 1]
n05 = [1, 4, 6, 4, 1]
n06 = [1, 5, 10, 10, 5, 1]
"""


"""
第七题：
解释下面三个高阶函数的用法，选其中一个模仿实现其功能
enumerate()
zip()
map()
"""


"""
第八题：
我的作品_打乱.txt 里面是被打乱的作品
需要最后整理成 我的作品_整理.txt 的样子
"""


"""
第九题：
列表nums里面每个数都不相同，从里面找出两个数相加结果跟target相等，
返回这两个数的索引值
nums = [1, 2, 3, 5, 8, 7, 9]
target = 16
result = (4, 5)
"""


"""
第十题：
从下面两题中任选一个

第一题：
读取score.csv文件（注意编码）
求每个学生四科成绩总分并从大到小进行排序
写入新的文件score_sorted.csv

第二题：
查看日志.txt文件
1、统计出访问频率最高的ip地址
2、并把他的访问记录写入一个新的文件 高频访问ip.txt
"""














