

"""
月考
"""
"""
注：
每个题单独定义一个函数
如果标明需要返回值的，必须要有返回值
"""


"""
第一题：
返回一个列表
列表包含数字、字符串、列表、元祖、字典、集合六种数据
"""


"""
第二题：
s = 'k1:v1|| k2:v2|||k3:v3| |k4:v4'
s_new = 'k1:v1,k2:v2,k3:v3,k4:v4'
把字符串s处理成一个新的字符串s_new并返回
"""


"""
第三题：
lst = [1, 2, 3, 'a', 4, 'b', 5]
计算列表lst里面所有数字的和
并返回计算结果
"""


"""
第四题：
lst = [['老王', '开车'], ['去', '上班!']]
text = '老王开车去上班!'
把列表lst转换成字符串text并返回
"""


"""
第五题：
用循环打印出下面的菱形：大小不必完全一样
                   *                    
                  ***                   
                 *****                  
                *******                 
               *********                
              ***********               
             *************              
            ***************             
           *****************            
          *******************           
           *****************            
            ***************             
             *************              
              ***********               
               *********                
                *******                 
                 *****                  
                  ***                   
                   *   
"""


"""
第六题：
找出工资最高的人，并返回他的名字
data = {'佩奇':5000, '老男孩':6000, '海峰':7000, '马JJ':8000, '老村长':9000, '黑姑娘':10000}
"""


#
"""
第七题：
读取user_info.txt的信息
当输入某个人的姓名时，打印出这个人的电话号码
注：当输入的人名不存时程序不能出错，可以返回提示信息
"""


#
"""
第八题：
工资单.txt 里面姓名是三个字的,他们工资的总和是多少，返回工资总和
"""


#
"""
第九题：
我的作品_打乱.txt 里面是被打乱的作品
需要最后整理成 我的作品_整理.txt 的样子
"""


#
"""
第十题：
从车牌号.txt 文件里面找出所有符合要求的车牌号，
判断一下符合规范的车牌里面，号码是否全部都不一样
如果全部不一样返回True
否则返回False
"""


"""
第十一题：
写个函数
每次调用该函数返回一个符合要求的车牌号
车牌号要求：
五位数、必须同时包含数字和大写字母
"""


"""
第十二题：
把一百个不同的符合要求的车牌号写入文件
要求：每行十个，每个车牌号之间用空格隔开
"""






























