

"""
月考
"""
"""
注：
所有考题必须在函数内作答
"""

"""
第一题：
返回一个列表
列表包含数字、字符串、列表、元祖、字典、集合六种数据
每种数据必须命名
"""


"""
第二题：
s = 'k1:v1| k2:v2| k3:v3| k4:v4'
s_new = 'k1:v1,k2:v2,k3:v3,k4:v4'
把字符串s处理成一个新的字符串s_new并返回
"""


"""
第三题：
s = 'k1:v1 ||k2:v2|| k3:v3 ||k4:v4'
data = {'k1': 'v1', 'k2': 'v2', 'k3': 'v3', 'k4': 'v4'}
把字符串s处理成一个字典data并返回
"""


"""
第四题：
nums = [1, 2, 3, 4, 5]
计算出列表nums所有数的和、奇数的和、偶数的
注：不能用内置函数sum()
"""


"""
第五题：
nums = [1, 2, 3, 4, 5, 1]
找出列表nums最大数、最小数
注：不能用内置函数max()min()
"""


"""
第六题：
lst = [['老王', '开车'], ['去', '上班!']]
text = '老王开车去上!'
把列表lst转换成字符串text
"""



"""
第七题：
工资信息
data = {'佩奇':15000, '老男孩':6000, '海峰':7000, '马JJ':8000, '老村长':9000, '黑姑娘':10000, '白姑娘':10000}
找出工资大于8000的，之后把他们的姓名放进列表并返回
"""


"""
第八题：
工资单.txt 里面姓名是三个字的,他们工资的总和是多少
"""


"""
第九题：
num = 2
nums = [2, 4, 8, 16, 32, 64, 128]
#################################
num = 3
nums = [3, 6, 12, 24, 48, 96, 192]
给一个数num 生成nums这样的列表
注：找规律
"""
def func_09(num, length=6):
    nums = [num]
    for i in range(length):
        num *= 2
        nums.append(num)

    return nums

print(func_09(2))

"""
第十题：
给出一个整数字符串例如:s = '5800'
把s变成一个整数num = 5800
注：不能用内置函数int()
"""
def  func_10(s):
    s_map = dict(zip([str(i) for i in range(10)], [i for i in range(10)]))
    # print(s_map)
    num = 0
    for i in range(len(s)):
        num += s_map[s[-(i+1)]] * (10**i)
    # print(num, type(num))

    return num

func_10('5900')

if __name__ == '__main__':
    pass