


"""
周考
"""
"""
注：
所有考题必须在函数内作答
"""

"""
第一题：
给出一个数 num  注意：给出的num大于1
生成一个列表 num_list = [1, 2, ... num, num-1, ...2, 1]
例1：
num = 9
num_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1]
例2：
num = 2
num_list = [1, 2, 1]
"""
def create_nums(num):
    """
    第一题
    :param num:
    :return:
    """
    pass


"""
第二题：
用循环打印出下面的菱形：大小不必完全一样
                   *                    
                  ***                   
                 *****                  
                *******                 
               *********                
              ***********               
             *************              
            ***************             
           *****************            
          *******************           
           *****************            
            ***************             
             *************              
              ***********               
               *********                
                *******                 
                 *****                  
                  ***                   
                   *   
"""
def create_dimond_01():
    """
    第二题
    :return:
    """
    pass


"""
第三题：
用循环打印出下面的空心菱形：大小不必完全一样
                   *                    
                  * *                   
                 *   *                  
                *     *                 
               *       *                
              *         *               
             *           *              
            *             *             
           *               *            
          *                 *           
           *               *            
            *             *             
             *           *              
              *         *               
               *       *                
                *     *                 
                 *   *                  
                  * *                   
                   *  
"""
def create_dimond_02():
    """
    第三题
    :return:
    """
    pass


"""
第四题：
读取user_info.txt的信息
当输入某个人的姓名时，打印出这个人的电话号码
"""
def phone_num_get():
    """
    第四题
    :return:
    """
    pass


"""
第五题：
我的作品_打乱.txt 里面是被打乱的作品
需要最后整理成 我的作品_整理.txt 的样子
"""
def make_file():
    """
    第五题
    :return:
    """
    pass


"""
第六题：
找出工资最高的人
data = {'佩奇':5000, '老男孩':6000, '海峰':7000, '马JJ':8000, '老村长':9000, '黑姑娘':10000}
"""
def find_person():
    """
    第六题
    :return:
    """
    data = {'佩奇':5000, '老男孩':6000, '海峰':7000, '马JJ':8000, '老村长':9000, '黑姑娘':10000}
    pass


"""
第七题：
统计一下 车牌号.txt 文件里面有多少符合规范的车牌
规范：车牌里面必须包含数字和字母 
"""
def card_nums():
    """
    第七题
    :return:
    """
    pass


"""
第八题：
判断一下符合规范的车牌里面，号码是否全部都不一样
如果全部不一样返回True
否则返回False
"""
def is_all_different():
    """
    第八题
    :return:
    """
    pass


"""
第九题：
找出出现频率最高的车牌号，以及他们出现的频率
注：如果出现频率最高的有多个车牌，请全部找出来
"""
def find_max_cards():
    """
    第九题
    :return:
    """
    pass


