

"""
周考
"""
"""
所有考题必须在函数内作答
"""

"""
第一题：
给一段字符串，里面是一些连续重复的字符，统计他们每个字符出现的次数，
把统计结果以字符串的形式返回，返回的字符顺序必须跟源字符串里面的字符一致。
res = 'xxzzaaabbcdddeuuuuuut'
res_count = 'x2z2a3b2c1d3e1u6t1'
"""


"""
第二题：
说一下 可迭代对象、迭代器对象、生成器函数、生成器对象分别是什么以及他们之间的区别：
"""


"""
第三题：
1.如何判断一个对象是否是迭代器对象
2.哪几个内置函数返回的结果是迭代器对象，至少写两个，并解释他们的作用
"""


"""
第四题：
列举学过的几个模块，至少写五个，并解释他们的用处
"""


"""
第五题：
写一个函数，该函数接收一个参数nums，根据nums来控制打印的列表的数量
找规律打印相应的列表
n01 = [1]
n02 = [1, 1]
n03 = [1, 2, 1]
n04 = [1, 3, 3, 1]
n05 = [1, 4, 6, 4, 1]
n06 = [1, 5, 10, 10, 5, 1]
"""


"""
第六题：
找出列表里面只出现了一次的那个数
nums = [1, 2, 2, 3, 4, 4, 3, 1, 2, 2, 3, 4, 4, 3, 2, 3, 4, 4, 3, 1, 2, 2, 3,
        4, 3, 1, 2, 2, 3, 4, 4, 3, 2, 3, 4, 4, 3, 5, 2, 2, 2, 3, 4, 4, 3, 2,
        ]
注：不能用count()方法
"""


"""
第七题：
找出英文句子里面出现频率最高的单词
res = "Bob hit a ball, the hit BALL flew far after it was hit."
注：忽略大小写
"""


"""
第八题：
写个程序计算五天之后的日期时间，格式是字符串
"""


"""
第九题：
写个程序统计当前文件所在目录下，每个python文件的代码行数
数据返回格式：{'test01':20, 'test02':100}
注：空行不算
"""


"""
第十题：
下面的字符串是由一个两位长度的字符串加密的结果，
找出这个字符串并返回
提示：该字符串只包含小写字母
res = '25ed1bcb423b0b7200f485fc5ff71c8e'
"""


"""
第十一题：
用循环打印下面的图形：大小不必完全一样
              *               
             * *              
            *****             
           *     *            
          *********           
         *         *          
        *************         
       *             *        
      *****************       
     *                 *      
      *****************       
       *             *        
        *************         
         *         *          
          *********           
           *     *            
            *****             
             * *              
              *
"""


"""
第十二题：
写个函数把一个整数字符串转成整数
列如：'123' => 123, '230' => 230
注：不能用int(),eval()
"""



