

"""
周考
"""


"""10
第一题：
1、简述你对类和对象的理解
"""


"""10
第二题：
2、面向对象的三大特征？并简述自己的理解
"""


"""10
第三题：
3、__init__函数的作用？self是什么？
"""


"""10
第四题：
4、定义一个Person类：
    设置name/age都为私有属性
    对外提供 查看 修改 name的接口
    注：
        对name的类型进行限制，不管是初始化时还是修改时，
        name都必须是字符串，否则报错
"""


"""10
第五题：
5、定义一个类：
    里面包括类方法和静态方法
"""


"""15
第六题：
6、实现map()函数或者解释map函数的作用
print(list(map(lambda x, y:x*y, [1, 2], (i for i in range(10)))))
"""


"""10
第七题：
7、找出列表里面只出现了一次的那个数，把这个数和它的索引值返回
nums = [1, 2, 2, 3, 4, 4, 3, 1, 2, 2, 3, 4, 4, 3, 2, 3, 4, 4, 3, 1, 2, 2, 3,
        4, 3, 1, 2, 2, 3, 4, 4, 3, 2, 3, 4, 4, 3, 5, 2, 2, 2, 3, 4, 4, 3, 2,
        ]
注：
    1、不能用count()方法
    2、如果只用一次for循环可以求出结果的，总分再加5分
"""


"""15
第八题：
8、继承之前讲解的ATM程序，给该程序添加一个修改密码的功能，并修改主函数
"""


"""10
第九题：
9、写一个函数或者类，实现open()函数的所有功能，但可以借用open()函数
    最终效果：
    1、当打开一个文本文件(非二进制模式打开)，且不指定编码时，默认编码是utf8
    1、其它操作文件的功能一切正常，例如：当以二进制模式操作文件时，一切正常。
"""
def openNew():

    pass

class OpenNew:

    pass

# f = open('新建文本文档.txt', 'r')  # 默认编码为utf8



"""20
第十题：
10、找出英文句子里面出现频率最高的单词,如果有多个全部找出来，
    但请把出现在limit列表里面的单词剔除
res = "what are you talking about, show me your code."
limit = ['are']
注：忽略大小写
"""



