# ! /usr/bin/env python
# -*- coding: utf-8 -*-
# __author__ = "liuluyang"
# Datetime: 2019/12/6 11:42



"""
月考
"""


"""15
from itertools import count

测试count的用法
1、解释count的用法（参数，返回值、返回值类型等方面）
2、写个类模仿count的功能
"""


"""15
列表nums里面每个数都不相同，从里面找出两个数相加结果跟target相等，
返回这两个数的索引值
nums = [1, 2, 3, 5, 7, 9]
target = 16

result = (4, 5)
"""


"""15
读取score.csv文件（注意编码）
求每个学生四科成绩总分并从大到小进行排序
写入新的文件score_sorted.csv
"""


"""15
写一个函数
def open_file(file):
    pass

1、该函数只能够正常读取gbk或者utf8编码的文本文件, 然后返回文件内容
2、如果读取失败（解码失败），主动触发异常，异常内容为：该文件不是gbk或utf8编码
3、其他异常正常抛出
"""


"""15
写五个特殊方法，解释并演示他们的用法
"""


"""15
查看日志.txt文件
1、统计出访问频率最高的ip地址
2、并把他的访问记录写入一个新的文件 高频访问ip.txt
"""


"""30
写一个练习打字的程序
要求：
1、读取文件内容、对内容进行处理
2、开始一行一行打字，每打一行，把打错的字标出来，并计算正确率
3、‘close()’为结束程序的标志
4、结束打字时，把打字开始时间、用时、总字数、正确率等信息写入文件。

初始化函数  __init__
读取文件    content
统计每行正确率  count
打字结束统计信息  close
开始打字主函数       start
"""















